OpenFOAM-13/tutorials/fluid/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    U       (0 0 0);
    T       348.432;
    p       100000;
}

zones
{
    lowPressure
    {
        type        box;
        zoneType    cell;

        box         (0 -1 -1) (5 1 1);

        values
        {
            T       278.746;
            p       10000;
        }
    }
}


// ************************************************************************* //
